#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_instance.chat will be created
  + resource "google_compute_instance" "chat" {
      + allow_stopping_for_update = true
      + can_ip_forward            = false
      + cpu_platform              = (known after apply)
      + deletion_protection       = false
      + guest_accelerator         = (known after apply)
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + label_fingerprint         = (known after apply)
      + machine_type              = "n1-standard-1"
      + metadata_fingerprint      = (known after apply)
      + metadata_startup_script   = "#!/bin/bash\n\nset -euo pipefail\n\necho \"Hello, world!\"\n\nif [ ! -f GCSFUSE_IS_INSTALLED ]; then\n  echo \"Installing gcsfuse\"\n  GCSFUSE_REPO=gcsfuse-$(lsb_release -c -s)\n  echo \"deb http://packages.cloud.google.com/apt $GCSFUSE_REPO main\" | tee /etc/apt/sources.list.d/gcsfuse.list\n  curl https://packages.cloud.google.com/apt/doc/apt-key.gpg | apt-key add -\n\n  apt-get update\n  apt-get install -y gcsfuse\n  touch GCSFUSE_IS_INSTALLED\nfi\n\nif [ ! -f DOCKER_COMPOSE_IS_INSTALLED ]; then\n  echo \"Installing docker-compose\"\n  apt-get install -y docker-compose\n  touch DOCKER_COMPOSE_IS_INSTALLED\nfi\n\nif ! id -u synapse > /dev/null 2>&1; then\n  echo \"Creating the synapse user\"\n  groupadd -g 1337 synapse\n  # TODO: use rootless docker\n  useradd -m -u 1337 -g synapse -G docker synapse\nfi\n\necho \"Creating the mount point for keys\"\nmkdir -p /home/synapse/keys\nchown synapse:synapse /home/synapse/keys\n\n# Mount as root with allow_other which isn't great...\n# TODO: move to rootless docker so that we don't need to do this\necho \"Mounting the keys bucket\"\ngcsfuse --file-mode 600 --uid 1337 -o allow_other cmc-chat-keys /home/synapse/keys\n\necho \"Switching to synapse user\"\nsudo -u synapse /bin/bash <<EOF\n  cd /home/synapse\n  \n  export GIT_SSH_COMMAND='ssh -i ~/keys/github/deploy_key'\n  mkdir -p .ssh\n  ssh-keyscan github.com >> .ssh/known_hosts # YOLO\n  if [ -d \"cmc\" ]; then\n    echo \"Repo directory exists; pulling\"\n    cd cmc\n    git pull origin master\n  else\n    echo \"Cloning repo\"\n    git clone ssh://git@github.com/j3parker/cmc\n    cd cmc\n  fi \n\n  echo \"Starting containers\"\n  cd chat\n  docker-compose up --build\nEOF\n"
      + min_cpu_platform          = (known after apply)
      + name                      = "chat"
      + project                   = (known after apply)
      + self_link                 = (known after apply)
      + tags                      = [
          + "web",
        ]
      + tags_fingerprint          = (known after apply)
      + zone                      = "northamerica-northeast1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "https://www.googleapis.com/compute/v1/projects/gce-uefi-images/global/images/ubuntu-1804-bionic-v20191113"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "default"
          + network_ip         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = "34.95.33.143"
              + network_tier = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/devstorage.full_control",
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Test`, Action: `hashicorpterraform-github-actions3`, Working Directory: `terraform`*
